# Taps
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

# Non-nixpkgs tools
brew "mas"

# GUI apps from Hombrew
cask "atom"
cask "amethyst"
cask "arq"
cask "balenaetcher"
cask "firefox"
cask "font-jetbrainsmono-nerd-font-mono"
cask "google-chrome"
cask "google-drive-file-stream"
cask "gpg-suite"
cask "hammerspoon"
cask "hey"
cask "honer"
cask "keybase"
cask "launchbar"
cask "linear-linear"
cask "protonvpn"
cask "safari-technology-preview"
cask "signal"
cask "skype"
cask "steam"
cask "superhuman"
cask "tor-browser"
cask "transmission"
cask "transmit"
cask "typinator"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "visual-studio-code-insiders"
cask "vlc"
cask "yubico-authenticator"
cask "yubico-yubikey-manager"
cask "yubico-yubikey-personalization-gui"

# GUI apps from Mac App Store
mas "1Blocker",             id: 1107421413
mas "1Password",            id: 1333542190
mas "DaisyDisk",            id: 411643860
mas "Dark Mode for Safari", id: 1397180934
mas "Deliveries",           id: 924726344
mas "Fantastical",          id: 975937182
mas "Keynote",              id: 409183694
mas "LG Screen Manager",    id: 1142051783
mas "MindNode",             id: 1289197285
mas "Numbers",              id: 409203825
mas "Pages",                id: 409201541
mas "Patterns",             id: 429449079
mas "Pixelmator",           id: 407963104
mas "Pixelmator Pro",       id: 1289583905
mas "Slack",                id: 803453959
mas "SiteSucker",           id: 442168834
mas "Things 3",             id: 904280696
mas "Type Fu",              id: 509818877
mas "Ulysses",              id: 1225570693
mas "WiFi Explorer",        id: 494803304
mas "Xcode",                id: 497799835
