# Taps
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"

# Non-nixpkgs command line tools
brew "fish"
brew "mas"

# GUI apps from Hombrew
cask "atom"
cask "arq"
cask "balenaetcher"
cask "coda"
cask "dash"
cask "firefox"
cask "google-chrome"
cask "google-drive-file-stream"
cask "gpgtools"
cask "hammerspoon"
cask "keybase"
cask "protonvpn"
cask "signal"
cask "skype"
cask "steam"
cask "superhuman"
cask "torbrowser"
cask "transmission"
cask "transmit"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "visual-studio-code"
cask "vlc"
cask "yubico-authenticator"
cask "yubico-yubikey-manager"
cask "yubico-yubikey-personalization-gui"

# GUI apps from Mac App Store
mas "1Blocker",             id: 1107421413
mas "1Password",            id: 1333542190
mas "DaisyDisk",            id: 411643860
mas "Dark Mode for Safari", id: 1397180934
mas "Deliveries",           id: 924726344
mas "Fantastical",          id: 975937182
mas "Haskell",              id: 841285201
mas "iHex",                 id: 909566003
mas "Keynote",              id: 409183694
mas "LG Screen Manager",    id: 1142051783
mas "MindNode",             id: 1289197285
mas "Numbers",              id: 409203825
mas "OmniFocus",            id: 1346203938
mas "Pages",                id: 409201541
mas "Patterns",             id: 429449079
mas "Pixelmator",           id: 407963104
mas "Pixelmator Pro",       id: 1289583905
mas "Slack",                id: 803453959
mas "Speedtest",            id: 1153157709
mas "Ulysses",              id: 1225570693
mas "WiFi Explorer",        id: 494803304
mas "Xcode",                id: 497799835
